n = int(input('Введите N: '))
print(f'Таблица степеней двойки до {n} в десятичной системе:')
print('-------------------')
for i in range (0, n + 1):
    print(f'2^{i} = {2 ** i}')

print(f'Таблица степеней двойки до {n} в двоичной системе:')
print('-------------------')
for i in range (0, n + 1):
    print(f'2^{i} = {bin(2 ** i)[2:]}')

print(f'Таблица степеней двойки до {n} в шестнадцатиричной системе:')
print('-------------------')
for i in range (0, n + 1):
    print(f'2^{i} = {hex(2 ** i)[2:]}')